<?php
/**
 * Created by Caesar.
 */

return array(
    //厂家编号
    'factory' => array(
        'xm' => '新盟',
        'xx' => '星星',
        'qt' => '其他'
    ),
    //功能类型
    'functype' => array(
            '1' => '常温',
            '2' => '冷藏',
            '3' => '冷冻',
            '4' => '加热'
    ),
    //门数量
    'doortype' => array(
            '1' => '单门',
            '2' => '双门',
            '3' => '三门'
    ),
    //rfid类型
    'rfidtype' => array(
        '1' => '高频rfid',
        '2' => '超高频rfid',
        '3' => '重力感应'
    ),
    //使用场合
    'place' => array(
            '1' => '室内',
            '2' => '室外'
    ),
    //设备状态1待开柜 2已开柜3未开柜 4已关柜 5已拉取 6待分配 7停用故障 8待生产 9生产中 10设备上线
    'status' => array(
        '1' => '待开柜',
        '2' => '已开柜',
        '3' => '未开柜',
        '4' => '已关柜',
        '5' => '已拉取',
        '6' => '待分配',
        '7' => '停用故障',
        '8' => '待生产',
        '9' => '生产中',
        '10' => '设备上线'
    ),
    //运营状态1 未联通 2已初始化 3待分配 4正常运行 5故障 6停用
    'businessstatus' => array(
        '1' => '未联通',
        '2' => '已初始化',
        '3' => '待分配',
        '4' => '正常运行',
        '5' => '故障',
        '6' => '停用',
        '7' => '已作废'
    )

);
